---
type: CodeCheckingParameterServiceData
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# CodeCheckingParameterServiceData

`Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurrentElements | 2014 | `public IList < ElementId > GetCurrentElements ()` |
| Property | Document | 2014 | `public Document Document { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |